#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Apply 📖`success`
<details><summary>Show Apply</summary>
```

module.deploy_xyz_infrastructure.data.google_container_engine_versions.gke_version: Reading...
module.deploy_xyz_apps.data.google_client_config.provider: Reading...
module.deploy_xyz_bootstrap.data.google_client_config.provider: Reading...
module.deploy_xyz_bootstrap.data.google_client_config.provider: Read complete after 0s [id=projects/"test-project-miguel"/regions/<null>/zones/<null>]
module.deploy_xyz_apps.data.google_client_config.provider: Read complete after 0s [id=projects/"test-project-miguel"/regions/<null>/zones/<null>]
module.deploy_xyz_infrastructure.data.google_container_engine_versions.gke_version: Read complete after 1s [id=2024-02-07 21:21:04.517143334 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.deploy_xyz_apps.data.curl.test_application_endpoint will be read during apply
  # (config refers to values not yet known)
 <= data "curl" "test_application_endpoint" {
      + http_method = "GET"
      + id          = (known after apply)
      + response    = (known after apply)
      + uri         = (known after apply)
    }

  # module.deploy_xyz_apps.data.google_container_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_cluster" "cluster" {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + binary_authorization              = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + cost_management_config            = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + dns_config                        = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_l4_ilb_subsetting          = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + gateway_api_config                = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "us-central1"
      + logging_config                    = (known after apply)
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + mesh_certificates                 = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_config                 = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = "test-project-miguel-gke"
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_pool_defaults                = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + project                           = "test-project-miguel"
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + security_posture_config           = (known after apply)
      + self_link                         = (known after apply)
      + service_external_ips_config       = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # module.deploy_xyz_apps.data.kubernetes_service.argocd_apps will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "argocd_apps" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "xyz-liatrio-demo"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.deploy_xyz_apps.helm_release.argocd_apps will be created
  + resource "helm_release" "argocd_apps" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-apps"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications: 
                - name: "xyz-liatrio-demo"
                  namespace: "argocd"
                  additionalAnnotations:
                    argocd-image-updater.argoproj.io/image-list: "liatrio=us-central1-docker.pkg.dev/test-project-miguel/xyz-liatrio-poc/xyz-liatrio:dev"
                    argocd-image-updater.argoproj.io/liatrio.force-update: "true"
                    argocd-image-updater.argoproj.io/liatrio.update-strategy: "digest"
                  source:
                    path: "charts/xyz-liatrio"
                    repoURL: "https://github.com/miguelortize/liatrio-xyz-poc"
                    targetRevision: "HEAD"
                  destination:
                    server: "https://kubernetes.default.svc"
                    namespace: "default"
                  syncPolicy:
                    automated:
                      prune: false
                      selfHeal: false
                  project: "default"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.6.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.deploy_xyz_apps.time_sleep.wait_300_seconds will be created
  + resource "time_sleep" "wait_300_seconds" {
      + create_duration = "300s"
      + id              = (known after apply)
    }

  # module.deploy_xyz_bootstrap.data.google_container_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_cluster" "cluster" {
      + addons_config                     = (known after apply)
      + authenticator_groups_config       = (known after apply)
      + binary_authorization              = (known after apply)
      + cluster_autoscaling               = (known after apply)
      + cluster_ipv4_cidr                 = (known after apply)
      + confidential_nodes                = (known after apply)
      + cost_management_config            = (known after apply)
      + database_encryption               = (known after apply)
      + datapath_provider                 = (known after apply)
      + default_max_pods_per_node         = (known after apply)
      + default_snat_status               = (known after apply)
      + description                       = (known after apply)
      + dns_config                        = (known after apply)
      + enable_autopilot                  = (known after apply)
      + enable_binary_authorization       = (known after apply)
      + enable_intranode_visibility       = (known after apply)
      + enable_kubernetes_alpha           = (known after apply)
      + enable_l4_ilb_subsetting          = (known after apply)
      + enable_legacy_abac                = (known after apply)
      + enable_shielded_nodes             = (known after apply)
      + enable_tpu                        = (known after apply)
      + endpoint                          = (known after apply)
      + gateway_api_config                = (known after apply)
      + id                                = (known after apply)
      + initial_node_count                = (known after apply)
      + ip_allocation_policy              = (known after apply)
      + label_fingerprint                 = (known after apply)
      + location                          = "us-central1"
      + logging_config                    = (known after apply)
      + logging_service                   = (known after apply)
      + maintenance_policy                = (known after apply)
      + master_auth                       = (known after apply)
      + master_authorized_networks_config = (known after apply)
      + master_version                    = (known after apply)
      + mesh_certificates                 = (known after apply)
      + min_master_version                = (known after apply)
      + monitoring_config                 = (known after apply)
      + monitoring_service                = (known after apply)
      + name                              = "test-project-miguel-gke"
      + network                           = (known after apply)
      + network_policy                    = (known after apply)
      + networking_mode                   = (known after apply)
      + node_config                       = (known after apply)
      + node_locations                    = (known after apply)
      + node_pool                         = (known after apply)
      + node_pool_defaults                = (known after apply)
      + node_version                      = (known after apply)
      + notification_config               = (known after apply)
      + operation                         = (known after apply)
      + private_cluster_config            = (known after apply)
      + private_ipv6_google_access        = (known after apply)
      + project                           = "test-project-miguel"
      + release_channel                   = (known after apply)
      + remove_default_node_pool          = (known after apply)
      + resource_labels                   = (known after apply)
      + resource_usage_export_config      = (known after apply)
      + security_posture_config           = (known after apply)
      + self_link                         = (known after apply)
      + service_external_ips_config       = (known after apply)
      + services_ipv4_cidr                = (known after apply)
      + subnetwork                        = (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      + vertical_pod_autoscaling          = (known after apply)
      + workload_identity_config          = (known after apply)
    }

  # module.deploy_xyz_bootstrap.data.kubernetes_service.app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "app" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-server"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.deploy_xyz_bootstrap.helm_release.app will be created
  + resource "helm_release" "app" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "5.55.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "server.service.type"
          + value = "LoadBalancer"
        }
    }

  # module.deploy_xyz_bootstrap.helm_release.image_updater will be created
  + resource "helm_release" "image_updater" {
      + atomic                     = false
      + chart                      = "argocd-image-updater"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-image-updater"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                replicaCount: 1
                image:
                  repository: quay.io/argoprojlabs/argocd-image-updater
                  pullPolicy: Always
                  tag: ""
                
                updateStrategy:
                  type: Recreate
                imagePullSecrets: []
                nameOverride: ""
                fullnameOverride: ""
                
                extraArgs: []
                
                extraEnv: []
                
                extraObjects: []
                
                initContainers: []
                
                volumeMounts: []
                
                volumes: []
                
                config:
                
                  applicationsAPIKind: ""
                
                  argocd:
                  
                    grpcWeb: true
                  
                    serverAddress: ""
                  
                    insecure: false
                  
                    plaintext: false
                  
                    token: ""
                
                  disableKubeEvents: false
                
                  gitCommitUser: ""
                
                  gitCommitMail: ""
                
                  gitCommitTemplate: ""
                
                  logLevel: "info"
                
                  registries: 
                    - name: Google Container Registry
                      api_url: https://us-central1-docker.pkg.dev/test-project-miguel/xyz-liatrio-poc
                      prefix: gcr.io
                      default: true
                
                  sshConfig:
                    {}
                
                authScripts:
                  enabled: false
                  scripts: {}
                serviceAccount:
                  create: true
                  annotations: {}
                  name: ""
                podAnnotations: {}
                podLabels: {}
                podSecurityContext: {}
                securityContext: {}
                rbac:
                  enabled: true
                resources: {}
                nodeSelector: {}
                tolerations: []
                affinity: {}
                metrics:
                  enabled: false
                  service:
                  
                    annotations: {}
                  
                    labels: {}
                  
                    servicePort: 8081
                  serviceMonitor:
                  
                    enabled: false
                  
                    interval: 30s
                  
                    relabelings: []
                  
                    metricRelabelings: []
                  
                    selector: {}
                
                    namespace: ""
                  
                    additionalLabels: {}
            EOT,
        ]
      + verify                     = false
      + version                    = "0.9.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.deploy_xyz_infrastructure.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "test-project-miguel-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = (known after apply)
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.deploy_xyz_infrastructure.google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.10.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "test-project-miguel-subnet"
      + network                    = "test-project-miguel-vpc"
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.deploy_xyz_infrastructure.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "test-project-miguel-gke"
      + network                     = "test-project-miguel-vpc"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "test-project-miguel-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
    }

  # module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "test-project-miguel-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "test-project-miguel-gke"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = "1.27.8-gke.1067004"

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "test-project-miguel"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "test-project-miguel-gke",
            ]
          + taint             = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + argocd_load_balancer_endpoint = (known after apply)
  + kubernetes_cluster_host       = (known after apply)
  + kubernetes_cluster_name       = "test-project-miguel-gke"
  + project_id                    = "test-project-miguel"
  + region                        = "us-central1"
  + xyz_app_endpoint              = (known after apply)
  + xyz_deployment_test           = (known after apply)
module.deploy_xyz_infrastructure.google_compute_network.vpc: Creating...
module.deploy_xyz_infrastructure.google_compute_network.vpc: Still creating... [10s elapsed]
module.deploy_xyz_infrastructure.google_compute_network.vpc: Creation complete after 11s [id=projects/test-project-miguel/global/networks/test-project-miguel-vpc]
module.deploy_xyz_infrastructure.google_compute_subnetwork.subnet: Creating...
module.deploy_xyz_infrastructure.google_compute_subnetwork.subnet: Still creating... [10s elapsed]
module.deploy_xyz_infrastructure.google_compute_subnetwork.subnet: Still creating... [20s elapsed]
module.deploy_xyz_infrastructure.google_compute_subnetwork.subnet: Creation complete after 22s [id=projects/test-project-miguel/regions/us-central1/subnetworks/test-project-miguel-subnet]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Creating...
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [1m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [1m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [1m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [1m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [1m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [1m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [2m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [2m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [2m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [2m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [2m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [2m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [3m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [3m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [3m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [3m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [3m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [3m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [4m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [4m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [4m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [4m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [4m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [4m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [5m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [5m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [5m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [5m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [5m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [5m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [6m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [6m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [6m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [6m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [6m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [6m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [7m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [7m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [7m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [7m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [7m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [7m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [8m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [8m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [8m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [8m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [8m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [8m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [9m0s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [9m10s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [9m20s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [9m30s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [9m40s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Still creating... [9m50s elapsed]
module.deploy_xyz_infrastructure.google_container_cluster.primary: Creation complete after 9m59s [id=projects/test-project-miguel/locations/us-central1/clusters/test-project-miguel-gke]
module.deploy_xyz_bootstrap.data.google_container_cluster.cluster: Reading...
module.deploy_xyz_apps.data.google_container_cluster.cluster: Reading...
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Creating...
module.deploy_xyz_apps.data.google_container_cluster.cluster: Read complete after 0s [id=projects/test-project-miguel/locations/us-central1/clusters/test-project-miguel-gke]
module.deploy_xyz_bootstrap.data.google_container_cluster.cluster: Read complete after 1s [id=projects/test-project-miguel/locations/us-central1/clusters/test-project-miguel-gke]
module.deploy_xyz_bootstrap.helm_release.app: Creating...
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [10s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [10s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [20s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [20s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [30s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [30s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [40s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [40s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [50s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [50s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [1m0s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [1m0s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [1m10s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [1m10s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Still creating... [1m20s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [1m20s elapsed]
module.deploy_xyz_infrastructure.google_container_node_pool.primary_nodes: Creation complete after 1m23s [id=projects/test-project-miguel/locations/us-central1/clusters/test-project-miguel-gke/nodePools/test-project-miguel-gke]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [1m30s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [1m40s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [1m50s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [2m0s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [2m10s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Still creating... [2m20s elapsed]
module.deploy_xyz_bootstrap.helm_release.app: Creation complete after 2m21s [id=argocd]
module.deploy_xyz_bootstrap.data.kubernetes_service.app: Reading...
module.deploy_xyz_bootstrap.data.kubernetes_service.app: Read complete after 0s [id=argocd/argocd-server]
module.deploy_xyz_bootstrap.helm_release.image_updater: Creating...
module.deploy_xyz_apps.helm_release.argocd_apps: Creating...
module.deploy_xyz_apps.helm_release.argocd_apps: Creation complete after 3s [id=argocd-apps]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Creating...
module.deploy_xyz_bootstrap.helm_release.image_updater: Still creating... [10s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [10s elapsed]
module.deploy_xyz_bootstrap.helm_release.image_updater: Creation complete after 19s [id=argocd-image-updater]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [20s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [30s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [40s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [50s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [1m0s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [1m10s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [1m20s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [1m30s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [1m40s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [1m50s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [2m0s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [2m10s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [2m20s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [2m30s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [2m40s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [2m50s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [3m0s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [3m10s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [3m20s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [3m30s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [3m40s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [3m50s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [4m0s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [4m10s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [4m20s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [4m30s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [4m40s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Still creating... [4m50s elapsed]
module.deploy_xyz_apps.time_sleep.wait_300_seconds: Creation complete after 5m0s [id=2024-02-07T21:39:03Z]
module.deploy_xyz_apps.data.kubernetes_service.argocd_apps: Reading...
module.deploy_xyz_apps.data.kubernetes_service.argocd_apps: Read complete after 0s [id=default/xyz-liatrio-demo]
module.deploy_xyz_apps.data.curl.test_application_endpoint: Reading...
module.deploy_xyz_apps.data.curl.test_application_endpoint: Read complete after 0s [id=1707341943]

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

Outputs:

argocd_load_balancer_endpoint = "http://34.170.157.85:80"
kubernetes_cluster_host = "35.184.229.70"
kubernetes_cluster_name = "test-project-miguel-gke"
project_id = "test-project-miguel"
region = "us-central1"
xyz_app_endpoint = "http://34.28.59.98:80"
xyz_deployment_test = {
  "message" = "Automate all the things!"
  "timestamp" = 1707341943
}

```
</details>
*Pusher: @miguelortize, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform`*